module UnicodeFixer
  # rubocop:disable Layout/HashAlignment
  BROKEN_CHAR_MAP = {
    'â‚¬' => '€',
    'â€š' => ',',
    'Æ’'  => 'ƒ',
    'â€ž' => '„',
    'â€¦' => '…',
    'Ë†'  => 'ˆ',
    'â€°' => '‰',
    'â€¹' => '‹',
    'â€˜' => '‘',
    'â€™' => '’',
    'â€œ' => '“',
    'â€¢' => '•',
    'â€“' => '–',
    'â€”' => '—',
    'Ëœ'  => '˜',
    'â„¢' => '™',
    'â€º' => '›',
    'â€'  => '”',
    'Â°'  => '°',
    'Â¸'  => '¸',
    'Â§'  => '§',
    'Â¬'  => '-',
    'Â£'  => '£',
    'Â«'  => '«',
    'Â»'  => '»',
    'Â®'  => '®',
    'Â©'  => '©',
    'Â²'  => '²',
    'Â³'  => '³',
    'Âµ'  => 'µ',
    'Â´'  => '´',
    'Â'   => '',
    'Ã±'  => 'ñ',
    'Ã¡'  => 'á',
    'Ã¢'  => 'â',
    'Ã£'  => 'ã',
    'Ã¤'  => 'ä',
    'Ã§'  => 'ç',
    'Ã¨'  => 'è',
    'Ã©'  => 'é',
    'Ãª'  => 'ê',
    'Ã´'  => 'ô',
    'Ã³'  => 'ó',
    'Ã¶'  => 'ö',
    'Ãº'  => 'ú',
    'Ã¼'  => 'ü',
    'Ã«'  => 'ë',
    'Ã '  => 'à'
  }.freeze
  # rubocop:enable Layout/HashAlignment

  def self.fix_unicode_characters(text)
    return if text.nil?

    text.gsub(Regexp.union(BROKEN_CHAR_MAP.keys), BROKEN_CHAR_MAP)
  end
end
